src/Reports/УниверсальныйОтчет/УниверсальныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УниверсальныйОтчет</name>
  <attributes>
    <name>ОбъектДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСхемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Report>

src/Reports/УниверсальныйОтчет/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.РежимВызоваОтчета Тогда
		Элементы.ОбъектДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеОбъектыДанных());
	Иначе
		Элементы.Группа1.Видимость = Ложь;
		ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		Элементы.ОсновнаяКоманднаяПанель.Видимость = Ложь;
//		АвтоЗаголовок = Ложь;
//		Заголовок = КлючТекущегоВарианта;
	КонецЕсли;
	Если Параметры.Свойство("ПараметрыЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Отчет, Параметры.ПараметрыЗаполнения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбъектДанныхПриИзменении(Элементы.ОбъектДанных);
	
КонецПроцедуры


&НаСервере
Функция ДоступныеОбъектыДанных()
	ОбъектыДанных = Новый Массив;
	ДопустимыеОбъекты = Новый Массив;
	ДопустимыеОбъекты.Добавить("Справочники");
	ДопустимыеОбъекты.Добавить("Документы");
	Для Каждого ВидОбъекта Из ДопустимыеОбъекты Цикл
		Для Каждого Элемент Из Метаданные[ВидОбъекта] Цикл
			ОбъектыДанных.Добавить(Элемент.ПолноеИмя());	
		КонецЦикла;
	КонецЦикла;
	Возврат ОбъектыДанных;
КонецФункции

&НаКлиенте
Процедура ОбъектДанныхПриИзменении(Элемент)
	Элементы.ИмяСхемы.СписокВыбора.ЗагрузитьЗначения(ОбъектДанныхПриИзмененииНаСервере(Отчет.ОбъектДанных));
//	Отчет.ИмяСхемы = "";
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектДанныхПриИзмененииНаСервере(ИмяОбъектаДанных)
	Макеты = Новый Массив;
	ОбъектДанных = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаДанных);
	Для Каждого Элемент Из ОбъектДанных.Макеты Цикл
		Макеты.Добавить(Элемент.Имя);
	КонецЦикла;
	Возврат Макеты;
КонецФункции

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	УстановитьСхему(Отчет.ОбъектДанных, Отчет.ИмяСхемы);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСхему(знач ОбъектДанных, знач ИмяСхемы)
	Менеджер = Новый (СтрЗаменить(ОбъектДанных, ".", "Менеджер."));
	СхемаКомпоновкиДанных = Менеджер.ПолучитьМакет(ИмяСхемы);
	ХранилищеОбщихНастроек.Сохранить("УниверсальныйОтчет", , СхемаКомпоновкиДанных, , ИмяПользователя());
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Заголовок = ПредставлениеТекущегоВарианта;
КонецПроцедуры
